#include <iostream>
using namespace std;
int main() {
	setlocale(LC_ALL, "rus");
	//for (int i = -10; i <= 10; i = i + 2) {
	//	cout << i << " ";
	//}
	//int s = 0;
	//for (int i = 1; i <= 5; i = i + 1) {
	//	s = s + i;
	//	cout << s << " ";
	//}
	//ТАБЛИЦА
	//for (int i = 1; i <= 10; i = i + 1) {
	//	cout << "3 * " << i << " = " << 3 * i << endl;
	//}
	//1. Составьте программу, выводящую на экран квадраты чисел от 10 до 20.
	//for (int i = 10; i <= 20; i = i + 1) {
	//	cout << i * i << endl;
	//}
	//2. Составьте программу, которая вычисляет сумму чисел от 1 до n.значение n вводится с клавиатуры.
	//int n, s;
	//s = 0;
	//cin >> n;
	//for (int i = 1; i <= n; i = i + 1) {
	//	s = s + i;
	//	cout << s << " ";
	//}
	//3. Составьте программу, которая вычисляет произведение чисел от 1 до n.n вводится с клавиатуры.
	//int n, s;
	//s = 1;
	//cin >> n;
	//for (int i = 1; i <= n; i = i + 1) {
	//	s = s * i;
	//	cout << s << endl;
	//}
	//4. С клавиатуры вводятся n чисел. Составьте программу, которая определяет кол-во отрицательных, кол-во положительных и кол-во нулей среди введеных чисел.Значение n вводится с клавиатуры.
	//int n, x;
	//cin >> n;
	//int kp = 0;
	//int kp1 = 0;
	//int kp2 = 0;
	//for (int i = 1; i <= n; i = i + 1) {
	//	cin >> x;
	//	if (x > 0) {
	//		kp++;
	//		cout << "положительных = " << kp << endl;
	//	}
	//	else
	//		if (x < 0) {
	//			kp1++;
	//			cout << "отрицательных = " << kp1 << endl;
	//		}
	//		else
	//			if (x == 0) {
	//				kp2++;
	//				cout << "ноль = " << kp2 << endl;
	//			}
	//}
	//5. Составьте программы перевода старинных русских мер длины, торгового и аптекарского веса(счетчик цикла от 1 до 10) из дюймов в сантиметры(1 дюйм равен 2,5 см)
	//double a = 2.5;
	//for (int i = 1; i <= 10; i = i + 1) {
	//	cout << i << " дюймов" << " = " << a * i << endl;
	//}
}